load-tests/homepage.yml
config:
  target: "https://scaliyo.com"
  phases:
    - duration: 30
      arrivalRate: 5
      name: "Warm up"
    - duration: 60
      arrivalRate: 20
      name: "Sustained load"
    - duration: 30
      arrivalRate: 50
      name: "Peak load"
  defaults:
    headers:
      Accept-Encoding: "gzip, br"

scenarios:
  - name: "Homepage + assets"
    flow:
      - get:
          url: "/"
      - think: 1
      - get:
          url: "/assets/index-BYHEwBuH.css"
      - get:
          url: "/assets/index-zpqAfgNO.js"
      - think: 2

  - name: "Full page load simulation"
    flow:
      - get:
          url: "/"
      - get:
          url: "/assets/index-BYHEwBuH.css"
      - get:
          url: "/assets/index-zpqAfgNO.js"
      - get:
          url: "/assets/vendor-react-B0kr7u-i.js"
      - get:
          url: "/assets/vendor-supabase-DdzJP3aL.js"
      - think: 3
      - get:
          url: "/"